{
  "basics": {
    "name": "Luís Deschamps Rudge",
    "label": "Developer",
    "picture": "https://s.gravatar.com/avatar/72956a2f6ee6c25ad00d194cf7543719?s=200",
    "email": "luis@luisrudge.net",
    "phone": "+55 (48) 9172-1214",
    "website": "luisrudge.net",
    "summary": "I'm passionate about technology and writing code to create and improve products and services. I love helping others grow by giving internal and external presentations. After moving to Florianópolis, I started contributing with the local .NET user group and my first talk was insane. That was the tipping point for me and so I started my blog. I'm currently working for a company handling massive amounts of data using Microsoft Azure and AWS a lot and I'm currently the guy in charge of automating and managing most of the things in that area.  These years I've being delivering talks in many conferences like The Developers Conference (Florianópolis, Porto Alegre and São Paulo) and helping to organize events like the Global Windows Azure Summit in Florianópolis. Recently, as a Microsoft Azure Insider, I was part of a team that tested the Azure Datacenter in Brazil.",
    "location": {
      "address": "Rua dos Lordes, 595 ap 205 - Ingleses",
      "postalCode": "88058-525",
      "city": "Florianópolis",
      "countryCode": "BR",
      "region": "Santa Catarina"
    },
    "profiles": [{
      "network": "Twitter",
      "username": "luisrudge",
      "url": "https://twitter.com/luisrudge"
    }, {
      "network": "Github",
      "username": "luisrudge",
      "url": "https://github.com/luisrudge"
    }, {
      "network": "Skype",
      "username": "luis_rudge",
      "url": ""
    }]
  },
  "work": [{
    "company": "Way2 Technology",
    "position": "Developer",
    "website": "http://way2.com.br/en/",
    "startDate": "2013-04-08",
    "summary": "Way2 is a software and service company focused on the electricity sector. We develop software that allows our clients to perform remote metering of electricity from the point of generation all the way to the end consumer, passing through substations, transformers and other points of interest. Based on that measured data we offer a series of tools to support our clients, like billing automation, energy recovery and other critical services.",
    "highlights": [
      "Migrating our build, CI and test infrastructure to Microsoft Azure",
      "Automating our deployment workflow with Octopus Deploy",
      "Leading the deployment of TeamCity and Octopus Deploy inside the regulatory agency of electricity in Brazil",
      "Splitting our big monolithic service into a client/server architecture allowing us to scale very easily",
      "Leading migration of our dashboards from Silverlight/WCF to WebApi and modern web techniques"
    ]
  }, {
    "company": "Tecnologia Única",
    "position": "Developer",
    "website": "http://tecnologiaunica.com.br/",
    "startDate": "2011-06-01",
    "endDate": "2013-04-01",
    "summary": "I worked with a team of 4 to build an app that manages loyalty programs campaigns. This app is used by major banks, credit cards companies and loyalty programs in Brazil, Spain, Italy and Portugal as Itau, Santander, American Express and Europeans Banks.  The app manages the entire workflow of a loyalty campaign, from the first contact with the end user, with custom made e-shops, through the delivery of the product to the final customer.",
    "highlights": [
      "Creating heavy integrations with third party warehouses, banks and credit card companies",
      "Creating a prototype realtime sales dashboard that turned into a product"
    ]
  }, {
    "company": "Unic Learning",
    "position": "CTO / Co-founder",
    "website": "http://uniclearning.com.br",
    "startDate": "2012-02-01",
    "summary": "Unic an e-learning SaaS app. It's focused both on the content consumers (studentes) and the content creators (teachers, editors, supervisors etc). I'm in charge of all the tech related areas of the app.",
    "highlights": [
      "Building the entire thing from the ground up"
    ]
  }],
  "volunteer": [],
  "education": [],
  "awards": [],
  "publications": [],
  "skills": [{
    "name": "Client",
    "level": "",
    "keywords": [
      "HTML5",
      "CSS3",
      "ES6",
      "Gulp",
      "Knockout",
      "Angular",
      "React",
      "KendoUI"
    ]
  }, {
    "name": "Server",
    "level": "",
    "keywords": [
      "ASP.NET",
      "Nancy",
      "Node.JS"
    ]
  }, {
    "name": "Data",
    "level": "",
    "keywords": [
      "SQL Server",
      "elasticsearch",
      "RethinkDB",
      "Redis"
    ]
  }, {
    "name": "Other",
    "level": "",
    "keywords": [
      "Octopus Deploy",
      "TeamCity",
      "Azure",
      "git",
      "SignalR",
      "Devops",
      "Dataflow Library"
    ]
  }],
  "languages": [{
    "language": "Portuguese",
    "fluency": "Native speaker"
  }, {
    "language": "English",
    "fluency": "Intermediate"
  }, {
    "language": "Spanish",
    "fluency": "Basic"
  }],
  "interests": [{
    "name": "Life",
    "keywords": [
      "Movies",
      "Driving",
      "Traveling",
      "Music production"
    ]
  }, {
    "name": "Latest tech hype",
    "keywords": [
      "Docker",
      "Microservices",
      "Isomorphic apps",
      "Realtime apps"
    ]
  }],
  "references": []
}
